photonthunder/RA4M3_Zephyr/misc/ek_ra4w1_ek_ra6m3/zephyr/samples/bluetooth/ble_ek_ra4w1/qe_gen/ble/profile_cmn/r_ble_servc_if.c
            set_conn_idx(p_data->conn_hdl, p_conn_evt_param->p_addr);
        } break;

        case BLE_GATTC_EVENT_DISCONN_IND:
        {
            clear_conn_idx(p_data->conn_hdl);
        } break;

        case BLE_GATTC_EVENT_CHAR_READ_RSP:
        {
            st_ble_gattc_rd_char_evt_t *p_rd_char_evt_param =
                (st_ble_gattc_rd_char_evt_t *)p_data->p_param;

            read_evt_handler(p_data->conn_hdl,
                             p_rd_char_evt_param->read_data.attr_hdl,
                             &p_rd_char_evt_param->read_data.value,
                             result);
        } break;

        case BLE_GATTC_EVENT_CHAR_PART_READ_RSP:
        {
            st_ble_gattc_rd_char_evt_t *p_rd_char_evt_param =
                (st_ble_gattc_rd_char_evt_t *)p_data->p_param;

            uint8_t conn_idx = find_conn_idx_from_conn_hdl(p_data->conn_hdl);

            const st_ble_servc_info_t      *p_client = NULL;
            const st_ble_servc_char_info_t *p_attr   = NULL;
            find_attr(conn_idx, p_rd_char_evt_param->read_data.attr_hdl, &p_client, &p_attr);

            if (NULL != p_attr)
            {
                if (p_rd_char_evt_param->read_data.attr_hdl ==
                    p_attr->p_attr_hdls[conn_idx].start_hdl + 1)
                {
                    if (BLE_SUCCESS == result)
                    {
                        if (NULL == gs_conn_info[conn_idx].p_read_buf)
                        {
                            gs_conn_info[conn_idx].p_read_buf = malloc(p_attr->db_size);
                            memset(gs_conn_info[conn_idx].p_read_buf, 0x00, p_attr->db_size);

                            gs_conn_info[conn_idx].read_buf_pos  = 0;
                            gs_conn_info[conn_idx].read_attr_hdl = p_rd_char_evt_param->read_data.attr_hdl;
                        }

                        memcpy(&gs_conn_info[conn_idx].p_read_buf[gs_conn_info[conn_idx].read_buf_pos],
                               p_rd_char_evt_param->read_data.value.p_value, 
                               p_rd_char_evt_param->read_data.value.value_len);
                        gs_conn_info[conn_idx].read_buf_pos += p_rd_char_evt_param->read_data.value.value_len;
                    }
                    else
                    {
                        if (NULL != gs_conn_info[conn_idx].p_read_buf)
                        {
                            free(gs_conn_info[conn_idx].p_read_buf);
                            gs_conn_info[conn_idx].p_read_buf = NULL;
                            gs_conn_info[conn_idx].read_buf_pos  = 0;
                            gs_conn_info[conn_idx].read_attr_hdl = 0;
                        }

                        if (NULL != p_attr->read_rsp_cb)
                        {
                            p_attr->read_rsp_cb(p_attr, p_data->conn_hdl, result, NULL);
                        }
                        else
                        {
                            st_ble_servc_evt_data_t evt_data = {
                                .conn_hdl  = p_data->conn_hdl,
                                .param_len = 0,
                                .p_param   = NULL,
                            };
                            p_client->cb(BLE_SERVC_MULTI_ATTR_EVENT(p_attr->char_idx, p_attr->inst_idx, BLE_SERVC_READ_RSP), result, &evt_data);
                        }
                    }
                }
                else
                {
                    for (uint8_t d = 0; d < p_attr->num_of_descs; d++)
                    {
                        if (p_rd_char_evt_param->read_data.attr_hdl ==
                            p_attr->pp_descs[d]->p_attr_hdls[conn_idx])
                        {
                            if (BLE_SUCCESS == result)
                            {
                                if (NULL == gs_conn_info[conn_idx].p_read_buf)
                                {
                                    gs_conn_info[conn_idx].p_read_buf    = malloc(p_attr->pp_descs[d]->db_size);
                                    memset(gs_conn_info[conn_idx].p_read_buf, 0x00, p_attr->pp_descs[d]->db_size);

                                    gs_conn_info[conn_idx].read_buf_pos  = 0;
                                    gs_conn_info[conn_idx].read_attr_hdl = p_rd_char_evt_param->read_data.attr_hdl;
                                }

                                memcpy(&gs_conn_info[conn_idx].p_read_buf[gs_conn_info[conn_idx].read_buf_pos],
                                       p_rd_char_evt_param->read_data.value.p_value, 
                                       p_rd_char_evt_param->read_data.value.value_len);
                                gs_conn_info[conn_idx].read_buf_pos += p_rd_char_evt_param->read_data.value.value_len;
                            }
                            else
                            {
                                if (NULL != gs_conn_info[conn_idx].p_read_buf)
                                {
                                    free(gs_conn_info[conn_idx].p_read_buf);
                                    gs_conn_info[conn_idx].p_read_buf = NULL;
                                    gs_conn_info[conn_idx].read_buf_pos  = 0;
                                    gs_conn_info[conn_idx].read_attr_hdl = 0;
                                }

                                if (NULL != p_attr->pp_descs[d]->read_rsp_cb)
                                {
                                    p_attr->pp_descs[d]->read_rsp_cb(p_attr, p_data->conn_hdl, result, NULL);
                                }
                                else
                                {
                                    st_ble_servc_evt_data_t evt_data = {
                                        .conn_hdl  = p_data->conn_hdl,
                                        .param_len = 0,
                                        .p_param   = NULL,
                                    };
                                    p_client->cb(BLE_SERVC_MULTI_ATTR_EVENT(p_attr->pp_descs[d]->desc_idx, p_attr->pp_descs[d]->inst_idx, BLE_SERVC_READ_RSP), result, &evt_data);
                                }
                            }
                            break;
                        }
                    }
                }
            }
        } break;

        case BLE_GATTC_EVENT_LONG_CHAR_READ_COMP:
        {
            uint8_t conn_idx = find_conn_idx_from_conn_hdl(p_data->conn_hdl);

            st_ble_gatt_value_t value = {
                .p_value   = gs_conn_info[conn_idx].p_read_buf,
                .value_len = gs_conn_info[conn_idx].read_buf_pos,
            };

            read_evt_handler(p_data->conn_hdl,
                             gs_conn_info[conn_idx].read_attr_hdl,
                             &value,
                             result);

            free(gs_conn_info[conn_idx].p_read_buf);
            gs_conn_info[conn_idx].p_read_buf = NULL;
            gs_conn_info[conn_idx].read_buf_pos  = 0;
            gs_conn_info[conn_idx].read_attr_hdl = 0;
        } break;

        case BLE_GATTC_EVENT_CHAR_WRITE_RSP:
        {
            st_ble_gattc_wr_char_evt_t *p_wr_char_evt_param =
                (st_ble_gattc_wr_char_evt_t *)p_data->p_param;
            write_evt_handler(p_data->conn_hdl, p_wr_char_evt_param->value_hdl, result);
        } break;

        case BLE_GATTC_EVENT_CHAR_PART_WRITE_RSP:
        {
            uint8_t conn_idx = find_conn_idx_from_conn_hdl(p_data->conn_hdl);

            st_ble_gattc_char_part_wr_evt_t *p_char_part_wr_param =
                (st_ble_gattc_char_part_wr_evt_t *)p_data->p_param;

            gs_conn_info[conn_idx].write_attr_hdl = p_char_part_wr_param->write_data.attr_hdl;
        } break;

        case BLE_GATTC_EVENT_LONG_CHAR_WRITE_COMP:
        {
            uint8_t conn_idx = find_conn_idx_from_conn_hdl(p_data->conn_hdl);
            write_evt_handler(p_data->conn_hdl, gs_conn_info[conn_idx].write_attr_hdl, result);
        } break;

        case BLE_GATTC_EVENT_HDL_VAL_NTF:
        {
            st_ble_gatt_hdl_value_pair_t *p_hdl_value_pair_param =
                (st_ble_gatt_hdl_value_pair_t *)p_data->p_param;

            uint8_t conn_idx = find_conn_idx_from_conn_hdl(p_data->conn_hdl);

            const st_ble_servc_info_t      *p_client = NULL;
            const st_ble_servc_char_info_t *p_attr   = NULL;
            find_attr(conn_idx, p_hdl_value_pair_param->attr_hdl, &p_client, &p_attr);

            if ((NULL != p_attr) && (NULL != p_attr->decode))
            {
                void *p_app_value;

                p_app_value = malloc(p_attr->app_size);
                memset(p_app_value, 0x00, p_attr->app_size);

                p_attr->decode(p_app_value, &p_hdl_value_pair_param->value);

                if (NULL != p_attr->hdl_val_ntf_cb)
                {
                    p_attr->hdl_val_ntf_cb(p_attr, p_data->conn_hdl, p_app_value);
                }
                else
                {
                    st_ble_servc_evt_data_t evt_data = {
                        .conn_hdl  = p_data->conn_hdl,
                        .param_len = p_attr->app_size,
                        .p_param   = p_app_value,
                    };
                    p_client->cb(BLE_SERVC_MULTI_ATTR_EVENT(p_attr->char_idx, p_attr->inst_idx, BLE_SERVC_HDL_VAL_NTF), BLE_SUCCESS, &evt_data);
                }

                free(p_app_value);
            }
        } break;

